Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Revision.Hash Property
 Gets the revision hash identifier.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Hash {
	get;
 }
Public ReadOnly Property Hash As String
		Get
Property Value
Type: String
 The revision hash.
See Also
Reference
ReferenceModel.Revision Structure
Tekla.Structures.Model Namespace